backend/controllers/SiteController.php

    public function actionTenders() {
        $val = @$_POST['sort'];
        $page = @$_REQUEST['page'];
        $filter = @$_GET['filter'];

        $tenders = \common\models\Tender::find()->orderBy(['id' => SORT_DESC]);
        $countQuery = clone $tenders;
        if ($val && $page) {
            $items_per_page = $val;
            $pages = new Pagination(['totalCount' => $countQuery->count(), 'defaultPageSize' => $val, 'pageSize' => $val]);
            /* if ($page) {
              $offset = ($page - 1) * $items_per_page;
              } else {
              $offset = 0;
              } */
            $offset = $pages->offset;
        } else {
            if ($filter) {
                $fval = $filter;
            } else {
                $fval = '10';
            }
            $pages = new Pagination(['totalCount' => $countQuery->count(), 'defaultPageSize' => $fval, 'pageSize' => $fval]);
            $offset = $pages->offset;
            $items_per_page = $fval;
        }

        $models = $tenders->offset($offset)->limit($items_per_page)->all();
---
SELECT COUNT(*) FROM `tenders`
SELECT * FROM `tenders` ORDER BY `id` DESC LIMIT 10

        if ($val) {
            return $this->redirect(array('site/tenders?filter=' . $val . ''));
        } else {
            return $this->render('tenders', [
                        'tenders' => $models,
                        'contractors' => $contractors,
                        'pages' => $pages,
                        'total' => $countQuery->count(),
                        'type' => 'All',
                        'url' => 'tenders'
            ]);
---
SELECT COUNT(*) FROM `tenders`

                    }
                }

                $tender = \Yii::$app
                        ->db
                        ->createCommand()
                        ->insert('tenders', $model)
                        ->execute();
---
INSERT INTO `tenders` (`id`, `command`, `cengineer`, `cwengineer`, `gengineer`, `work`, `reference_no`, `tender_id`, `published_date`, `document_date`, `bid_sub_date`, `bid_end_date`, `bid_opening_date`, `user_id`, `tfile`, `createdon`, `status`, `technical_status`, `financial_status`, `aoc_status`, `aoc_date`, `cvalue`, `qvalue`, `contractor`) VALUES (NULL, 8, 17, 46, NULL, 'GE/KHU-T-46/2018-19 REPAIR/MAINTENANCE OF EXTERNAL ELECTRIFICATION AT KHUMBATHANG UNDER GE KHUMBATHANG', 'GE/KHU-T-46/2018-19', '2019_MES_233831_1', '24-01-2019', '24-01-2019', '24-01-2019', '30-01-2019', '30-01-2019', 3, 'http://s3.us-east-2.amazonaws.com/aadhdata/files/2019_MES_233831_1.zip', '2019-02-04 12:09:18', 0, NULL, NULL, NULL, NULL, '22,50,000', NULL, NULL)

            die();
        } else {
            if ($id) {
                $tender = \common\models\Tender::find()->where(['id' => $id])->one();
---
SELECT * FROM `tenders` WHERE `id`='335'

                        $model->status = 1;
                    }

                    $tender = \Yii::$app
                            ->db
                            ->createCommand()
                            ->insert('items', $model)
                            ->execute();
---
INSERT INTO `items` (`id`, `tender_id`, `tenderone`, `tendertwo`, `tenderthree`, `tenderfour`, `tenderfive`, `tendersix`, `user_id`, `createdon`, `status`) VALUES (NULL, 334, 1, 1, 1, 2, 5, NULL, 3, '2019-02-04 11:42:10', 0)

                        $detail->status = 1;
                    }

                    $details = \Yii::$app
                            ->db
                            ->createCommand()
                            ->insert('itemdetails', $detail)
                            ->execute();
---
INSERT INTO `itemdetails` (`id`, `itemtender`, `description`, `units`, `quantity`, `make`, `core`, `typefitting`, `capacityfitting`, `makeid`, `user_id`, `item_id`, `createdon`, `status`) VALUES (NULL, '15', NULL, 'NOS', '25', '9,48,70', '', 7, 40, '', 3, 2184, '2019-02-04 11:42:10', 0)

                                $mdetail->status = 1;
                            }

                            $mdetails = \Yii::$app
                                    ->db
                                    ->createCommand()
                                    ->insert('makedetails', $mdetail)
                                    ->execute();
---
INSERT INTO `makedetails` (`id`, `itemtender`, `description`, `units`, `quantity`, `make`, `core`, `typefitting`, `capacityfitting`, `makeid`, `user_id`, `item_id`, `item_detail_id`, `createdon`, `status`) VALUES (NULL, '15', '15', 'NOS', '25', '9,48,70', '', 7, 40, '', 3, 2184, 2615, '2019-02-04 11:42:10', 0)

            die();
        } else {

            $makes = \common\models\Make::find()->where(['status' => 1])->all();
            $tenders = \common\models\Tender::find()->all();
            $idetails = \common\models\ItemDetails::find()->leftJoin('items', 'itemdetails.item_id = items.id')->where(['items.tender_id' => $tid])->orderBy(['itemdetails.id' => SORT_DESC])->all();
---
SELECT * FROM `makes` WHERE `status`=1
SELECT * FROM `tenders`
SELECT `itemdetails`.* FROM `itemdetails` LEFT JOIN `items` ON itemdetails.item_id = items.id WHERE `items`.`tender_id`='334' ORDER BY `itemdetails`.`id` DESC

                foreach ($idetails as $idetail) {
                    $descfull = 'E/M,';
                    $items = [];
                    $items = \common\models\Item::find()->where(['id' => $idetail->item_id])->one();
---
SELECT * FROM `items` WHERE `id`=2188

                    $makenameall = '';
                    if (@$makeids) {
                        foreach ($makeids as $mid) {
                            $makename = \common\models\Make::find()->where(['id' => $mid])->one();
---
SELECT * FROM `makes` WHERE `id`='10'

                        $descfull .= $six . ',';
                    }
                    $descfull = rtrim($descfull, ',');
                    $size = \common\models\Size::find()->where(['id' => $idetail->description])->one();
---
SELECT * FROM `sizes` WHERE `id` IS NULL

                    }
                }
            }
            $tenderdetail = \common\models\Tender::find()->where(['id' => $tid])->one();
---
SELECT * FROM `tenders` WHERE `id`='334'

    public function actionGetfourdata() {
        $value = $_REQUEST['value'];
        $subone = $_REQUEST['subone'];
        $subtwo = $_REQUEST['subtwo'];
        $item = 0;
        $data = '<option value="0" selected>Select</option>';
        if (($value == 1) || ($value == 12)) {
            $data .= '<option value="1">Copper</option>';
            $data .= '<option value="2">Aluminium</option>';
        } elseif ($value == 2) {
            $data .= '<option value="3">Domestic</option>';
            $data .= '<option value="4">Industrial</option>';
            $data .= '<option value="5">Street/Road</option>';
        } elseif ($value == 3) {
            $data .= '<option value="6">Ceiling fans</option>';
            $data .= '<option value="7">Wall fans</option>';
            $data .= '<option value="8">Exhaust fans</option>';
        } else {
            $item = 1;
        }

        $makes = [];
        $allmakes = [];
        if ($value) {
            $makes = \common\models\Make::find()->where(['mtype' => $value, 'status' => 1])->orderBy(['make' => SORT_ASC])->all();
---
SELECT * FROM `makes` WHERE (`mtype`='1') AND (`status`=1) ORDER BY `make`

        if ($value == 1) {
            $sizes = [];
            if ($value) {
                $sizes = \common\models\Size::find()->where(['mtypeone' => $value, 'mtypetwo' => $subone, 'mtypethree' => $subtwo, 'status' => 1])->orderBy(['size' => SORT_ASC])->all();
---
SELECT * FROM `sizes` WHERE (`mtypeone`='1') AND (`mtypetwo`='') AND (`mtypethree`='') AND (`status`=1) ORDER BY `size`

            }
        } else {
            $sizes = [];
            $sizes = \common\models\Size::find()->where(['mtypeone' => $value, 'status' => 1])->orderBy(['size' => SORT_ASC])->all();
---
SELECT * FROM `sizes` WHERE (`mtypeone`='2') AND (`status`=1) ORDER BY `size`

            }
        }

        $typefit = \common\models\Fitting::find()->where(['status' => 1, 'type' => 1])->orderBy(['text' => SORT_ASC])->all();
        $capacityfit = \common\models\Fitting::find()->where(['status' => 1, 'type' => 2])->orderBy(['text' => SORT_ASC])->all();
---
SELECT * FROM `fittings` WHERE (`status`=1) AND (`type`=1) ORDER BY `text`
SELECT * FROM `fittings` WHERE (`status`=1) AND (`type`=2) ORDER BY `text`

    public function actionGetsixdata() {
        $parent = $_REQUEST['parent'];
        $one = $_REQUEST['one'];
        $two = $_REQUEST['two'];
        $allsizes = [];
        $sizes = [];
        $sizes = \common\models\Size::find()->where(['mtypeone' => $parent, 'mtypetwo' => $one, 'mtypethree' => $two, 'status' => 1])->orderBy(['size' => SORT_ASC])->all();
---
SELECT * FROM `sizes` WHERE (`mtypeone`='1') AND (`mtypetwo`='2') AND (`mtypethree`='1') AND (`status`=1) ORDER BY `size`

    public function actionViewItems() {
        $user = Yii::$app->user->identity;
        $tid = @$_GET['id'];
        $tenderid = '';
        $tdetails = [];
        $tender = \common\models\Tender::find()->where(['id' => $tid])->one();
        if ($tender) {
            $tenderid = $tender->tender_id;
            $tdetails = $tender;
        } else {
            return $this->redirect(array('site/tenders'));
        }

        $idetails = \common\models\ItemDetails::find()->leftJoin('items', 'itemdetails.item_id = items.id')->where(['items.tender_id' => $tid])->orderBy(['itemdetails.id' => SORT_ASC])->all();

        if (@$idetails) {
            foreach ($idetails as $idetail) {
                $descfull = 'E/M,';
                $items = [];
                $items = \common\models\Item::find()->where(['id' => $idetail->item_id])->one();
                $makeids = explode(',', $idetail->make);
                $makenameall = '';
                if (@$makeids) {
                    foreach ($makeids as $mid) {
                        $makename = \common\models\Make::find()->where(['id' => $mid])->one();
---
SELECT * FROM `tenders` WHERE `id`='335'
SELECT `itemdetails`.* FROM `itemdetails` LEFT JOIN `items` ON itemdetails.item_id = items.id WHERE `items`.`tender_id`='335' ORDER BY `itemdetails`.`id`
SELECT * FROM `items` WHERE `id`=2189
SELECT * FROM `makes` WHERE `id`='10'

                    $descfull .= $six . ',';
                }
                $descfull = rtrim($descfull, ',');
                $size = \common\models\Size::find()->where(['id' => $idetail->description])->one();
---
SELECT * FROM `sizes` WHERE `id`='14'

    public function actionCreateFitting() {
        $user = Yii::$app->user->identity;
        $id = @$_GET['id'];

        if (isset($_POST['submit'])) {

            if ($_POST['id']) {
                $model = \common\models\Fitting::find()->where(['id' => $_POST['id']])->one();

                $fitting = \common\models\Fitting::find()->where(['text' => $_POST['text'], 'type' => $_POST['mtypeone']])->andWhere(['!=', 'id', $_POST['id']])->one();
                $model->type = $_POST['mtypeone'];
                $model->text = $_POST['text'];

                if ($fitting) {
                    Yii::$app->session->setFlash('error', "Fitting already existed");
                } else {
                    if ($model->save()) {
                        Yii::$app->session->setFlash('success', "Fitting successfully updated");
                    }
                }
                return $this->redirect(array('site/fittings'));
            } else {
                $model = new \common\models\Fitting();
                $model->type = $_POST['mtypeone'];
                $model->text = $_POST['text'];
                $model->user_id = $user->UserId;
                $model->createdon = date('Y-m-d h:i:s');
                $model->status = 1;
                $fitting = \common\models\Fitting::find()->where(['text' => $_POST['text'], 'type' => $_POST['mtypeone']])->one();
                if ($fitting) {
                    Yii::$app->session->setFlash('error', "Fitting already existed");
                } else {
                    $fittings = \Yii::$app
                            ->db
                            ->createCommand()
                            ->insert('fittings', $model)
                            ->execute();
---
SELECT * FROM `fittings` WHERE (`text`='72 Watt') AND (`type`='2')
INSERT INTO `fittings` (`id`, `type`, `text`, `user_id`, `createdon`, `status`) VALUES (NULL, '2', '72 Watt', 3, '2019-02-04 11:41:33', 1)

    public function actionEditItem($id) {

        if (isset($_POST['submit'])) {
            $user = Yii::$app->user->identity;
            if ($_POST['id']) {
                $item = \common\models\Item::find()->leftJoin('itemdetails', 'items.id = itemdetails.item_id')->where(['itemdetails.id' => $id])->one();
                $model = \common\models\ItemDetails::find()->where(['id' => $_POST['id']])->one();
                $model->itemtender = $_POST['itemtender'];
                $model->description = @$_POST['description'];
                $model->units = $_POST['units'];
                $model->quantity = $_POST['quantity'];
                $model->core = @$_POST['core'];
                $model->typefitting = @$_POST['typefitting'];
                $model->capacityfitting = @$_POST['capacityfitting'];
                $model->make = implode(',', $_POST['makes']);
                $model->makeid = $_POST['makeid'];

                $parentitem = \common\models\Item::find()->where(['id' => $_POST['item_id']])->one();
                $parentitem->tenderone = @$_POST['tenderone'];
                $parentitem->tendertwo = @$_POST['tendertwo'];
                $parentitem->tenderthree = @$_POST['tenderthree'];
                $parentitem->tenderfour = @$_POST['tenderfour'];
                $parentitem->tenderfive = @$_POST['tenderfive'];
                $parentitem->tendersix = @$_POST['tendersix'];
                $parentitem->save();

                $mitem = \common\models\MakeDetails::deleteAll(['item_detail_id' => $_POST['id']]);
---
SELECT `items`.* FROM `items` LEFT JOIN `itemdetails` ON items.id = itemdetails.item_id WHERE `itemdetails`.`id`='2616'
SELECT * FROM `itemdetails` WHERE `id`='2616'
SELECT * FROM `items` WHERE `id`='2185'
DELETE FROM `makedetails` WHERE `item_detail_id`='2616'

    public function actionGetmakes() {
        $user = Yii::$app->user->identity;
        $makes = [];
        $allmakes = [];
        $id = $_REQUEST['value'];
        if ($id) {
            $makes = \common\models\Make::find()->where(['mtype' => $id, 'status' => 1])->all();
---
SELECT * FROM `makes` WHERE (`mtype`='1') AND (`status`=1)

    public function actionGetsizes() {
        $user = Yii::$app->user->identity;
        $sizes = [];
        $allsizes = [];
        $parent = $_REQUEST['subparent'];
        $one = $_REQUEST['subone'];
        $two = $_REQUEST['subtwo'];
        if ($parent == 1) {
            $sizes = \common\models\Size::find()->where(['mtypeone' => $parent, 'mtypetwo' => $one, 'mtypethree' => $two, 'status' => 1])->all();
---
SELECT * FROM `sizes` WHERE (`mtypeone`='1') AND (`mtypetwo`='2') AND (`mtypethree`='1') AND (`status`=1)

    public function actionGetfittings() {
        $user = Yii::$app->user->identity;
        $alltypes = [];
        $allcapacities = [];

        $types = \common\models\Fitting::find()->where(['type' => 1, 'status' => 1])->all();
        $capacities = \common\models\Fitting::find()->where(['type' => 2, 'status' => 1])->all();
---
SELECT * FROM `fittings` WHERE (`type`=1) AND (`status`=1)
SELECT * FROM `fittings` WHERE (`type`=2) AND (`status`=1)

    public function actionGetfit($value) {
        if ($value) {
            $type = \common\models\Fitting::find()->where(['id' => $value, 'status' => 1])->one();
---
SELECT * FROM `fittings` WHERE (`id`=8) AND (`status`=1)