backend/views/site/tenders.php

                                        <h4>View Tender Files</h4>

                                        <div class="row">
                                            <?php $tech = \common\models\Tender::find()->where(['id' => $tender->id])->one(); ?>
---
SELECT * FROM `tenders` WHERE `id`=333

                                            </div>
                                        </div>
                                        <h4>View Technical Files</h4>
                                        <?php $techfiles = \common\models\Tenderfile::find()->where(['tender_id' => $tender->id, 'type' => 1])->orderBy(['id' => SORT_ASC])->all(); ?>
---
SELECT * FROM `tenderfiles` WHERE (`tender_id`=333) AND (`type`=1) ORDER BY `id`


                                        </div>
                                        <h4>View Financial Files</h4>
                                        <?php $finfiles = \common\models\Tenderfile::find()->where(['tender_id' => $tender->id, 'type' => 2])->orderBy(['id' => SORT_ASC])->all(); ?>
---
SELECT * FROM `tenderfiles` WHERE (`tender_id`=333) AND (`type`=2) ORDER BY `id`


                                        </div>
                                        <h4>View AOC Files</h4>
                                        <?php $aocfiles = \common\models\Tenderfile::find()->where(['tender_id' => $tender->id, 'type' => 3])->orderBy(['id' => SORT_ASC])->all(); ?>
---
SELECT * FROM `tenderfiles` WHERE (`tender_id`=333) AND (`type`=3) ORDER BY `id`